selfcheck/multiphase/driftFluxFoam/ras/tank3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.000259;

boundaryField
{
    SYMP3
    {
        type            slip;
    }

    INLE1
    {
        type            fixedValue;
        value           uniform 0.000259;
    }

    OUTL9
    {
        type            zeroGradient;
    }

    OUTL10
    {
        type            zeroGradient;
    }

    OUTL11
    {
        type            zeroGradient;
    }

    OUTL12
    {
        type            zeroGradient;
    }

    "WALL.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    OUTL15
    {
        type            inletOutlet;
        inletValue      uniform 0.000259;
    }
}

// ************************************************************************* //
